/**********************************
Author          : rJUEc
Version         : test_1.1.1.1  
R-Copyleft(r-ɔ) : Sun Nov 15 21:56:57 CST 2020
**********************************/
#ifndef test_1Module_POND_H
#define test_1Module_POND_H
/****************************/

namespace pond{
  /*******************************************************************
    test_1 模块中须定义 test_1Module 类作为接口类 
  *******************************************************************/
  class test_1Module:public Module{
  public  :
    /******************************************************************/
    test_1Module(); ~test_1Module();
    /*******************************************************************
      形如int PD_XXX(Object&) 这样前缀为 PD_ , Object& 做唯一参数， 以及
      返回值为 int 的函数，将自动注册到pond中，并可在 pond 脚本中调用.
    *******************************************************************/
    int     PD_hello(Object&);
    int     PD_incr(Object&);
    int     PD_j$j$(Object&);
  };
};

/****************************/
#endif



