/**********************************
Author          : rJUEc
Version         : test1.0.1.0  
R-Copyleft(r-ɔ) : Fri Nov 27 18:43:42 CST 2020
**********************************/
#ifndef test1Module_POND_H
#define test1Module_POND_H
/****************************/

namespace pond{
  /*******************************************************************
    test1 模块中须定义 test1Module 类作为接口类 
  *******************************************************************/
  class test1Module:public Module{
  public  :
    /******************************************************************/
    test1Module(); ~test1Module();
    /*******************************************************************
      形如int PD_XXX(Object&) 这样前缀为 PD_ , Object& 做唯一参数， 以及
      返回值为 int 的函数，将自动注册到pond中，并可在 pond 脚本中调用.
    *******************************************************************/
    int     PD_hello(Object&);
  };
};

/****************************/
#endif



